Test/HelloAndroid/Native/sample3.xml

<?xml version=\"1.0\" encoding=\"utf-8\"?>
<s:Envelope encodingStyle=\"http://www.w3.org/2003/05/soap-encoding\" xmlns:s=\"http://www.w3.org/2003/05/soap-envelope\">
<s:Body>
<u:SetTarget xmlns:u=\"urn:schemas-upnp-org:service:SwitchPower:1\">
<newTargetValue>1</newTargetValue>
</u:SetTarget>
</s:Body>
</s:Envelope><?xml version=\"1.0\" encoding=\"utf-8\"?>
<s:Envelope encodingStyle=\"http://www.w3.org/2003/05/soap-encoding\" xmlns:s=\"http://www.w3.org/2003/05/soap-envelope\">
<s:Body>
<u:SetTarget xmlns:u=\"urn:schemas-upnp-org:service:SwitchPower:1\">
<newTargetValue>1</newTargetValue>
</u:SetTarget>
</s:Body>
</s:Envelope><?xml version=\"1.0\" encoding=\"utf-8\"?>
<s:Envelope encodingStyle=\"http://www.w3.org/2003/05/soap-encoding\" xmlns:s=\"http://www.w3.org/2003/05/soap-envelope\">
<s:Body>
<u:SetTarget xmlns:u=\"urn:schemas-upnp-org:service:SwitchPower:1\">
<newTargetValue>1</newTargetValue>
</u:SetTarget>
</s:Body>
</s:Envelope><?xml version=\"1.0\" encoding=\"utf-8\"?>
<s:Envelope encodingStyle=\"http://www.w3.org/2003/05/soap-encoding\" xmlns:s=\"http://www.w3.org/2003/05/soap-envelope\">
<s:Body>
<u:SetTarget xmlns:u=\"urn:schemas-upnp-org:service:SwitchPower:1\">
<newTargetValue>1</newTargetValue>
</u:SetTarget>
</s:Body>
</s:Envelope><?xml version=\"1.0\" encoding=\"utf-8\"?>
<s:Envelope encodingStyle=\"http://www.w3.org/2003/05/soap-encoding\" xmlns:s=\"http://www.w3.org/2003/05/soap-envelope\">
<s:Body>
<u:SetTarget xmlns:u=\"urn:schemas-upnp-org:service:SwitchPower:1\">
<newTargetValue>1</newTargetValue>
</u:SetTarget>
</s:Body>
</s:Envelope><?xml version=\"1.0\" encoding=\"utf-8\"?>
<s:Envelope encodingStyle=\"http://www.w3.org/2003/05/soap-encoding\" xmlns:s=\"http://www.w3.org/2003/05/soap-envelope\">
<s:Body>
<u:SetTarget xmlns:u=\"urn:schemas-upnp-org:service:SwitchPower:1\">
<newTargetValue>1</newTargetValue>
</u:SetTarget>
</s:Body>
</s:Envelope><?xml version=\"1.0\" encoding=\"utf-8\"?>
<s:Envelope encodingStyle=\"http://www.w3.org/2003/05/soap-encoding\" xmlns:s=\"http://www.w3.org/2003/05/soap-envelope\">
<s:Body>
<u:SetTarget xmlns:u=\"urn:schemas-upnp-org:service:SwitchPower:1\">
<newTargetValue>1</newTargetValue>
</u:SetTarget>
</s:Body>
</s:Envelope><?xml version=\"1.0\" encoding=\"utf-8\"?>
<s:Envelope encodingStyle=\"http://www.w3.org/2003/05/soap-encoding\" xmlns:s=\"http://www.w3.org/2003/05/soap-envelope\">
<s:Body>
<u:SetTarget xmlns:u=\"urn:schemas-upnp-org:service:SwitchPower:1\">
<newTargetValue>1</newTargetValue>
</u:SetTarget>
</s:Body>
</s:Envelope><?xml version=\"1.0\" encoding=\"utf-8\"?>
<s:Envelope encodingStyle=\"http://www.w3.org/2003/05/soap-encoding\" xmlns:s=\"http://www.w3.org/2003/05/soap-envelope\">
<s:Body>
<u:SetTarget xmlns:u=\"urn:schemas-upnp-org:service:SwitchPower:1\">
<newTargetValue>1</newTargetValue>
</u:SetTarget>
</s:Body>
</s:Envelope>